app/views/customers/_form.html.erb

SELECT "drivers".* FROM "drivers"
---
  <%= f.label :driver_id %>
  <%= f.collection_select :driver_id, Driver.all, :id, :full_name, include_blank: true %>