app/views/customers/show.html.erb

<p>
  <% if @customer.drivers.present? %>
---
SELECT "drivers".* FROM "drivers" INNER JOIN "customers_drivers" ON "drivers"."id" = "customers_drivers"."driver_id" WHERE "customers_drivers"."customer_id" = ?  [["customer_id", 1]]