app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)
    driver = Driver.find(params[:customer][:driver_id])
    @customer.save
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "customers" ("first_name", "last_name", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", "Pozd"], ["phone", "gfhjjkl"], ["email", "ggfffdfd"], ["created_at", "2020-04-27 20:32:12.422970"], ["updated_at", "2020-04-27 20:32:12.422970"]]

  def update
    if @customer.update(customer_params)
---
UPDATE "customers" SET "first_name" = ?, "last_name" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name", "Add"], ["last_name", "New"], ["phone", "1234567890"], ["email", "example@example.com"], ["updated_at", "2020-05-03 23:58:28.250623"], ["id", 43]]

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 567], ["LIMIT", 1]]