app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers"
---
  def index
    @drivers = Driver.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "drivers" ("first_name", "last_name", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @driver = Driver.new(driver_params)
    customer = Customer.find(params[:driver][:customer_id])
    @driver.save

UPDATE "drivers" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["first_name", "First"], ["last_name", "Driver"], ["updated_at", "2020-06-01 22:15:11.670278"], ["id", 1]]
---
  def update
    if @driver.update(driver_params)

DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 5]]
---
  def destroy
    @driver.destroy

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_driver
      @driver = Driver.find(params[:id])