app/views/drivers/_form.html.erb

  <%= f.label :customer_id %>
  <%= f.collection_select :customer_id, Customer.all, :id, :full_name, include_blank: true %>
---
SELECT "customers".* FROM "customers"