app/views/drivers/show.html.erb

<p>
  <% if @driver.customers.present? %>
---
SELECT  "customers".* FROM "customers" INNER JOIN "customers_drivers" ON "customers"."id" = "customers_drivers"."customer_id" WHERE "customers_drivers"."driver_id" = ? ORDER BY "customers"."id" DESC LIMIT ?  [["driver_id", 2], ["LIMIT", 1]]